//*********************************************************
//
// Copyright (c) Microsoft. All rights reserved.
//
//*********************************************************

//
// S2_SuggestionsEastAsian.xaml.cpp
// Implementation of the S2_SuggestionsEastAsian class
//

#include "pch.h"
#include "S2_SuggestionsEastAsian.xaml.h"
#include "MainPage.xaml.h"

using namespace std;
using namespace Platform;
using namespace SDKSample;
using namespace SDKSample::SearchControl;
using namespace Windows::ApplicationModel::Search;
using namespace Windows::UI::Xaml;
using namespace Windows::UI::Xaml::Controls;

S2_SuggestionsEastAsian::S2_SuggestionsEastAsian()
{
    InitializeComponent();
}

void S2_SuggestionsEastAsian::OnSearchBoxEventsSuggestionsRequested(Object^ sender, SearchBoxSuggestionsRequestedEventArgs^ e)
{
    auto queryText = e->QueryText;
    if (queryText->Length() != 0)
    {
        // If the string matches the query text shown in the search box, add suggestion to the search box.
        AppendSuggestion(queryText->Data(), e);

        // If the string matches against one of the query alternatives, add suggestion to the search box.
        auto queryTextAlternatives = e->LinguisticDetails->QueryTextAlternatives;
        for (const auto& alternative : queryTextAlternatives)
        {
            AppendSuggestion(alternative->Data(), e);
        }
    }
}

void S2_SuggestionsEastAsian::AppendSuggestion(wstring textToMatch, SearchBoxSuggestionsRequestedEventArgs^ e)
{
    // App provided list of Japanese city/ward names
    static wstring suggestionList[] =
    {
        L"特別区部", L"横浜市", L"大阪市", L"名古屋市", L"札幌市", L"神戸市", L"京都市", L"福岡市", L"川崎市", L"さいたま市",
        L"広島市", L"仙台市", L"北九州市", L"千葉市", L"世田谷区", L"堺市", L"新潟市", L"浜松市", L"熊本市", L"相模原市", L"練馬区", L"静岡市", L"岡山市",
        L"大田区", L"足立区", L"江戸川区", L"船橋市", L"鹿児島市", L"八王子市", L"杉並区", L"姫路市", L"板橋区", L"松山市", L"宇都宮市", L"東大阪市",
        L"川口市", L"松戸市", L"西宮市", L"倉敷市", L"市川市", L"大分市", L"金沢市", L"福山市", L"江東区", L"尼崎市", L"長崎市", L"葛飾区", L"町田市",
        L"富山市", L"豊田市", L"高松市", L"横須賀市", L"岐阜市", L"藤沢市", L"枚方市", L"柏市", L"宮崎市", L"豊中市", L"長野市", L"豊橋市", L"一宮市",
        L"岡崎市", L"高崎市", L"和歌山市", L"奈良市", L"品川区", L"高槻市", L"吹田市", L"旭川市", L"高知市", L"川越市", L"いわき市", L"所沢市", L"前橋市",
        L"郡山市", L"大津市", L"北区", L"越谷市", L"新宿区", L"秋田市", L"那覇市", L"中野区", L"四日市市", L"春日井市", L"久留米市", L"青森市", L"盛岡市",
        L"福島市", L"明石市", L"津市", L"豊島区", L"長岡市", L"下関市", L"市原市", L"函館市", L"茨木市", L"水戸市", L"目黒区", L"八尾市", L"加古川市", L"福井市",
        L"徳島市", L"佐世保市", L"平塚市", L"府中市", L"山形市", L"富士市", L"墨田区", L"草加市", L"松本市", L"呉市", L"寝屋川市", L"佐賀市", L"八戸市", L"春日部市",
        L"茅ヶ崎市", L"大和市", L"宝塚市", L"厚木市", L"上尾市", L"調布市", L"太田市", L"つくば市", L"伊勢崎市", L"文京区", L"港区", L"渋谷区", L"荒川区", L"上越市",
        L"熊谷市", L"沼津市", L"鈴鹿市", L"岸和田市", L"甲府市", L"小田原市", L"鳥取市", L"山口市", L"西東京市", L"伊丹市", L"松江市", L"日立市", L"東広島市", L"八千代市",
        L"宇治市", L"小平市", L"三鷹市", L"和泉市", L"弘前市", L"豊川市", L"釧路市", L"立川市", L"日野市", L"安城市", L"高岡市", L"台東区", L"鎌倉市", L"宇部市", L"苫小牧市",
        L"佐倉市", L"秦野市", L"都城市", L"磐田市", L"松阪市", L"帯広市", L"今治市", L"西尾市", L"浦安市", L"小山市", L"習志野市", L"流山市", L"大垣市", L"石巻市", L"上田市",
        L"新座市", L"ひたちなか市", L"川西市", L"狭山市", L"野田市", L"足利市", L"久喜市", L"東村山市", L"入間市", L"周南市", L"米子市", L"多摩市", L"小牧市", L"守口市",
        L"刈谷市", L"各務原市", L"尾道市", L"深谷市", L"岩国市", L"出雲市", L"焼津市", L"土浦市", L"古河市", L"藤枝市", L"諫早市", L"桑名市", L"栃木市", L"青梅市",
        L"武蔵野市", L"鶴岡市", L"稲沢市", L"大崎市", L"我孫子市", L"八代市", L"瀬戸市", L"富士宮市", L"小樽市", L"飯塚市", L"三郷市", L"延岡市", L"草津市", L"門真市",
        L"伊勢市", L"沖縄市", L"箕面市", L"朝霞市", L"木更津市", L"座間市", L"成田市", L"海老名市", L"霧島市", L"大東市", L"唐津市", L"会津若松市", L"北見市", L"橿原市",
        L"別府市", L"奥州市", L"松原市", L"長浜市", L"江別市", L"大牟田市", L"戸田市", L"中央区", L"新居浜市", L"桐生市", L"佐野市", L"国分寺市", L"鴻巣市", L"富田林市",
        L"小金井市", L"半田市", L"一関市", L"生駒市", L"那須塩原市", L"羽曳野市", L"うるま市", L"防府市", L"東久留米市", L"掛川市", L"東近江市", L"加須市", L"三田市",
        L"廿日市市", L"多治見市", L"河内長野市", L"昭島市", L"西条市", L"彦根市", L"三島市", L"酒田市", L"白山市", L"丸亀市", L"浦添市", L"取手市", L"筑西市", L"小松市",
        L"鎌ケ谷市", L"東海市", L"春日市", L"富士見市", L"津山市", L"ふじみ野市", L"飯田市", L"鹿屋市", L"池田市", L"鹿沼市", L"三条市", L"坂戸市", L"花巻市", L"新発田市",
        L"伊勢原市", L"泉佐野市", L"佐久市", L"三原市", L"島田市", L"筑紫野市", L"江南市", L"薩摩川内市", L"糸島市", L"横手市", L"可児市", L"伊賀市", L"安曇野市", L"宗像市",
        L"大野城市", L"神栖市", L"室蘭市", L"高砂市", L"千歳市", L"射水市", L"芦屋市", L"北上市", L"茂原市", L"高山市", L"甲賀市", L"亀岡市", L"坂井市", L"宜野湾市", L"柏崎市",
        L"関市", L"貝塚市", L"大村市", L"岩見沢市", L"東松山市", L"日光市", L"四国中央市", L"米沢市", L"君津市", L"天草市", L"御殿場市", L"大和郡山市", L"舞鶴市", L"大仙市",
        L"印西市", L"四街道市", L"あま市", L"行田市", L"越前市", L"豊岡市", L"大府市", L"由利本荘市", L"袋井市", L"稲城市", L"知多市", L"中津市", L"宇和島市", L"日進市",
        L"登米市", L"摂津市", L"飯能市", L"渋川市", L"綾瀬市", L"東大和市", L"八潮市", L"香取市", L"真岡市", L"蒲郡市", L"本庄市", L"燕市", L"近江八幡市", L"牛久市",
        L"北名古屋市", L"尾張旭市", L"三木市", L"中津川市", L"あきる野市", L"和光市", L"たつの市", L"龍ケ崎市", L"名張市", L"城陽市", L"長岡京市", L"石岡市", L"福知山市",
        L"笠間市", L"須賀川市", L"田辺市", L"大館市", L"狛江市", L"館林市", L"交野市", L"大田原市", L"泉大津市", L"佐伯市", L"守山市", L"阿南市", L"国立市", L"香芝市",
        L"犬山市", L"栗原市", L"柏原市", L"姶良市", L"桶川市", L"八幡市", L"清瀬市", L"甲斐市", L"気仙沼市", L"八街市", L"名取市", L"南アルプス市", L"碧南市", L"加賀市",
        L"蕨市", L"伊東市", L"柳川市", L"伊那市", L"日田市", L"南相馬市", L"笛吹市", L"太宰府市", L"行橋市", L"銚子市", L"武蔵村山市", L"鶴ヶ島市", L"木津川市", L"豊明市",
        L"志木市", L"玉名市", L"恵庭市", L"天理市", L"旭市", L"鳥栖市", L"八女市", L"北本市", L"三豊市", L"大和高田市", L"知立市", L"藤岡市", L"京田辺市", L"丹波市", L"敦賀市",
        L"塩尻市", L"鯖江市", L"羽島市", L"秩父市", L"村上市", L"橋本市", L"総社市", L"藤井寺市", L"十和田市", L"伊達市", L"鹿嶋市", L"清須市", L"紀の川市", L"常総市",
        L"吉川市", L"津島市", L"愛西市", L"白河市", L"山陽小野田市", L"玉野市", L"泉南市", L"田原市", L"栗東市", L"蓮田市", L"日向市", L"多賀城市", L"佐渡市", L"観音寺市",
        L"守谷市", L"天童市", L"千曲市", L"宇城市", L"東金市", L"浜田市", L"南魚沼市", L"鳴門市", L"むつ市", L"安中市", L"鳩ヶ谷市", L"土岐市", L"北広島市", L"袖ケ浦市",
        L"白井市", L"名護市", L"桜井市", L"みよし市", L"湖西市", L"二本松市", L"福生市", L"高石市", L"下野市", L"石狩市", L"宮古市", L"能代市", L"京丹後市", L"宇佐市",
        L"十日町市", L"小郡市", L"五所川原市", L"逗子市", L"大阪狭山市", L"古賀市", L"七尾市", L"日南市", L"直方市", L"四條畷市", L"日高市", L"糸満市", L"豊見城市",
        L"伊万里市", L"羽村市", L"阪南市", L"三次市", L"塩竈市", L"茅野市", L"朝倉市", L"常陸太田市", L"羽生市", L"坂東市", L"山武市", L"坂出市", L"出水市", L"福津市",
        L"山鹿市", L"荒尾市", L"下松市", L"合志市", L"常滑市", L"海南市", L"美濃加茂市", L"南砺市", L"志摩市", L"湖南市", L"五泉市", L"裾野市", L"向日市", L"笠岡市",
        L"那珂市", L"幸手市", L"萩市", L"恵那市", L"さぬき市", L"光市", L"岩出市", L"岡谷市", L"結城市", L"高島市", L"喜多方市", L"小美玉市", L"須坂市", L"富岡市", L"宮古島市",
        L"瑞穂市", L"みどり市", L"氷見市", L"登別市", L"沼田市", L"諏訪市", L"富里市", L"亀山市", L"湯沢市", L"日置市", L"倉吉市", L"武雄市", L"富士吉田市", L"田川市",
        L"赤穂市", L"南島原市", L"菊池市", L"鉾田市", L"益田市", L"野洲市", L"新城市", L"南あわじ市", L"小野市", L"南国市", L"砺波市", L"館山市", L"伊豆の国市", L"牧之原市",
        L"真庭市", L"能美市", L"筑後市", L"三浦市", L"小林市", L"富津市", L"加西市", L"北斗市", L"糸魚川市", L"島原市", L"岩倉市", L"洲本市", L"雲仙市", L"大洲市", L"千代田区",
        L"菊川市", L"北茨城市", L"石垣市", L"稲敷市", L"北杜市", L"淡路市", L"東根市", L"奄美市", L"桜川市", L"いなべ市", L"中野市", L"阿賀野市", L"常陸大宮市", L"小城市",
        L"下妻市", L"魚津市", L"さくら市", L"郡上市", L"つくばみらい市", L"指宿市", L"中間市", L"岩沼市", L"吉野川市", L"小諸市", L"高浜市", L"井原市", L"南足柄市",
        L"かすみがうら市", L"赤磐市", L"弥富市", L"篠山市", L"滝川市", L"東松島市", L"西脇市", L"嘉麻市", L"府中市", L"寒河江市", L"南房総市", L"西予市", L"雲南市",
        L"見附市", L"黒部市", L"安来市", L"臼杵市", L"三沢市", L"網走市", L"いすみ市", L"宍粟市", L"大船渡市", L"みやま市", L"小松島市", L"五島市", L"田村市", L"瑞浪市",
        L"魚沼市", L"庄原市", L"加東市", L"米原市", L"匝瑳市", L"南城市", L"稚内市", L"熱海市", L"釜石市", L"豊後大野市", L"阿波市", L"曽於市", L"南九州市", L"新庄市",
        L"南さつま市", L"小千谷市", L"八幡浜市", L"長門市", L"大田市", L"伊予市", L"海津市", L"瀬戸内市", L"備前市", L"相馬市", L"宇土市", L"行方市", L"大川市", L"白石市",
        L"つがる市", L"久慈市", L"山梨市", L"北秋田市", L"下呂市", L"伊達市", L"黒石市", L"浅口市", L"四万十市", L"葛城市", L"綾部市", L"鴨川市", L"人吉市", L"妙高市",
        L"矢板市", L"大野市", L"東温市", L"南丹市", L"境港市", L"本巣市", L"高梁市", L"平戸市", L"柳井市", L"由布市", L"御前崎市", L"かほく市", L"鹿角市", L"五條市",
        L"潟上市", L"対馬市", L"宇陀市", L"伊豆市", L"甲州市", L"新見市", L"上山市", L"香南市", L"善通寺市", L"平川市", L"駒ヶ根市", L"滑川市", L"南陽市", L"東かがわ市",
        L"都留市", L"志布志市", L"神埼市", L"朝来市", L"西都市", L"美馬市", L"韮崎市", L"男鹿市", L"杵築市", L"小矢部市", L"国東市", L"うきは市", L"本宮市", L"安芸高田市",
        L"新宮市", L"胎内市", L"小浜市", L"角田市", L"中央市", L"西海市", L"相生市", L"いちき串木野市", L"高萩市", L"鹿島市", L"東御市", L"有田市", L"名寄市", L"潮来市",
        L"美作市", L"御所市", L"宮若市", L"あわら市", L"三好市", L"上天草市", L"輪島市", L"大町市", L"加茂市", L"二戸市", L"山県市", L"仙北市", L"長井市", L"壱岐市", L"遠野市",
        L"伊佐市", L"根室市", L"那須烏山市", L"嬉野市", L"大竹市", L"香美市", L"土佐市", L"八幡平市", L"竹原市", L"美祢市", L"阿蘇市", L"大月市", L"にかほ市", L"上野原市",
        L"豊前市", L"江田島市", L"水俣市", L"村山市", L"飛騨市", L"養父市", L"御坊市", L"美唄市", L"江津市", L"勝山市", L"松浦市", L"下田市", L"紋別市", L"須崎市", L"留萌市",
        L"竹田市", L"富良野市", L"豊後高田市", L"深川市", L"枕崎市", L"飯山市", L"陸前高田市", L"阿久根市", L"羽咋市", L"美濃市", L"宿毛市", L"士別市", L"えびの市", L"鳥羽市",
        L"多久市", L"勝浦市", L"串間市", L"尾鷲市", L"宮津市", L"津久見市", L"熊野市", L"安芸市", L"砂川市", L"尾花沢市", L"垂水市", L"西之表市", L"芦別市", L"珠洲市",
        L"土佐清水市", L"室戸市", L"赤平市", L"夕張市", L"三笠市", L"歌志内市"
    };

    for (const auto& suggestion : suggestionList)
    {
        if (suggestion.find(textToMatch) == 0)
        {
            e->Request->SearchSuggestionCollection->AppendQuerySuggestion(ref new String(const_cast<wchar_t*>(suggestion.c_str())));
        }
    }
}

void S2_SuggestionsEastAsian::OnSearchBoxEventsQuerySubmitted(Object^ sender, SearchBoxQuerySubmittedEventArgs^ e)
{
    MainPage::Current->NotifyUser(e->QueryText, NotifyType::StatusMessage);
}